src/cfe/dadata/Catalogs/dd_НастройкиПодсистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>dd_НастройкиПодсистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользованиеСервиса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/dadata/CommonModules/dd_ОбщийМодульПовторноеИспользование/Ext/Module.bsl
Функция ПолучитьНастройкиПодсистемы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ИспользованиеСервиса", Ложь);
	СтруктураНастроек.Вставить("КлючДоступа", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	dd_НастройкиПодсистемы.ИспользованиеСервиса КАК ИспользованиеСервиса,
	|	dd_НастройкиПодсистемы.КлючДоступа КАК КлючДоступа
	|ИЗ
	|	Справочник.dd_НастройкиПодсистемы КАК dd_НастройкиПодсистемы
	|ГДЕ
	|	НЕ dd_НастройкиПодсистемы.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		СтруктураНастроек.ИспользованиеСервиса = Выборка.ИспользованиеСервиса;
		СтруктураНастроек.КлючДоступа = Выборка.КлючДоступа;
		
	КонецЕсли;
	
	Возврат СтруктураНастроек;
	
КонецФункции
